#+TITLE:First C program
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++
#+STARTUP:overview
#+OPTIONS:hideblocks
* [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][Org babel languages]]

  * C chunks require "C"
  * C++ chunks require "cpp"

* C: pun

  Source: [[king][King, ch. 2]]

  #+begin_src C
    #include <stdio.h>

    int main(void)
    {
      printf("To C, or not to C, that is the question.\n");
      return 0;
    }
  #+end_src

  #+RESULTS:
  | To C | or not to C | that is the question. |

  In the following code chunk, I use the flags
  * ~:main yes~, which builds a ~int main(void)~ function
  * ~:includes <stdio.h>~, which includes the ~stdio.h~ library
  * ~:exports both~ enables GitHub to print the output, too.

  #+begin_src C :exports both :main yes :includes <stdio.h>
    printf("hello world");
  #+end_src

  #+RESULTS:
  : hello world

* C++: Hello world

  #+begin_src cpp

    // This program outputs the message "Hello, World!" to the monitor

    #include "stdio.h"

    int main()  // C++ programs start by executing the function main
    {
      cout << "Hello, World!\n";  // output "Hello, World!"
      return 0;
    }

  #+end_src

  #+RESULTS:

* SQL

  #+begin_src sqlite
    drop table if exists r;
    create table t(a int, b int);
  #+end_src

* Sources

  <<gcc>> GNU gcc

  <<king>> King, C Programming 2nd ed.
